Repository: PendalF89/currencyconverter
Catalog: plugin/languages/currencyconverter-*.po
Languages: ru_ru

source: It seems that you have not tried to get a response from remote server via get_* method first.
ru_ru: Похоже, вы не попытались сначала использовать get_* метод для получения ответ от удаленного сервера.

source: Remote server return empty answer.
ru_ru: Удаленный сервер вернул пустой ответ.

source: Remote server return not supported response code.
ru_ru: Удаленный сервер вернул неподдерживаемый код ответа.

source: Remote server return invalid JSON object.
ru_ru: Удаленный сервер вернул поврежденный JSON-объект.

source: Settings
ru_ru: Настройки

source: Currency
ru_ru: Валюта

source: Thanks
ru_ru: Благодарности

source: Currency exchange rates: <a href="https://openexchangerates.org/" target="_blank">Open Exchange Rates</a>, <a href="http://www.cbr.ru/">Central Bank of Russia</a>. <a href="https://github.com/gosquared/flags" target="_blank">Countries flags</a> by GoSquared. Plugin created by <a href="http://exchangerate.guru/" target="_blank">exchangerate.guru</a>.
ru_ru: Курсы обмена валют: <a href="https://openexchangerates.org/" target="_blank">Open Exchange Rates</a>, <a href="http://www.cbr.ru/">Центральный банк Российской Федерации</a>. <a href="https://github.com/gosquared/flags" target="_blank">Флаги стран</a> от GoSquared. Плагин создан сайтом <a href="http://pokur.su/" target="_blank">pokur.su</a>.

source: Data provider
ru_ru: Поставщик данных

source: Different data providers may provide different sets of currencies and their prices. We recommend you select local data provider.
ru_ru: Различные поставщики данных могут предоставлять разный набор доступных валют, а цены одинаковых валют могут незначительно различаться. Мы рекомендуем выбирать локального поставщика данных.

source: Status: <code>%1$s</code>. The number of currencies: %2$s. Available currencies:
ru_ru: Состояние: <code>%1$s</code>. Количество валют: %2$s. Список доступных валют:

source: OK
ru_ru: ОК

source: Status: <code>%1$s</code>. Error message(s):
ru_ru: Состояние: <code>%1$s</code>. Сообщение об ошибке(-ах):

# Data provider status code. "FAILED" means that the provider are not available.
source: FAILED
ru_ru: Недоступно

source: Provider
ru_ru: Поставщик

source: Central Bank of Russia
ru_ru: Центральный банк Российской Федерации

source: Empty flag name
ru_ru: Пустое имя флага

# Homepage URL of plugin developer.
source: http://exchangerate.guru/
ru_ru: http://pokur.su/

source: <a href="%1$s" class="currency-converter-update-data-link">Exchange rate</a> on %2$s
ru_ru: <a href="%1$s" class="currency-converter-update-data-link">По курсу</a> на %2$s

source: F j, Y
ru_ru: j.n.Y

source: oxr
ru_ru: cbr

# Add new subset (greek, cyrillic, devanagari, vietnamese)
source: no-subset
ru_ru: cyrillic

source: Currency Converter. Minimalistic
ru_ru: Currency Converter. Минималистичный

source: Light minimalistic widget with solid, clean colors and gradients.
ru_ru: Легкий минималистичный виджет с яркими и чистыми цветами и градиентами.

source: Select data provider in <a href="%1$s">plugin settings</a>.
ru_ru: Выберите поставщика данных <a href="%1$s">настройках плагина</a>.

source: Title:
ru_ru: Заголовок:

source: Base currency:
ru_ru: Основная валюта:

source: The currency in which will be settled other currencies.
ru_ru: Валюта, в которой будут рассчитаны цены всех валют.

source: Currencies list:
ru_ru: Список валют:

source: The currencies which will be displayed in table. Separate by commas.
ru_ru: Валюты, которые будут показываться в таблице. Разделяйте запятыми.

source: Background color
ru_ru: Фоновый цвет

source: Predefined color schemes:
ru_ru: Готовые цветовые схемы:

source: First background color:
ru_ru: Первый фоновый цвет:

source: Second background color:
ru_ru: Второй фоновый цвет:

source: Font color:
ru_ru: Цвет текста:

source: Separator line color:
ru_ru: Цвет полосы разделителя:

source: Separator line opacity:
ru_ru: Прозрачность полосы разделителя:

source: Show last update date of currency exchange rate.
ru_ru: Показывать дату обновления курса валют.

source: Currency exchange rate
ru_ru: Курс обмена валют

source: USD
ru_ru: RUB

# WARNING: always use commas as separator
source: CAD, AUD, GBP
ru_ru: USD, EUR, GBP

source: Currency Converter. Table
ru_ru: Currency Converter. Таблица

source: A table with currency rates.
ru_ru: Таблица с курсами валют.

source: Flag icons:
ru_ru: Иконки флагов:

source: No flag icon
ru_ru: Без иконки флага

source: Table headers
ru_ru: Заголовки таблицы

source: Currencies names col:
ru_ru: Колонка названия валют:

source: Price col:
ru_ru: Колонка цены валют:

source: Change col:
ru_ru: Колонка изменения цены валют:

source: Exchange table
ru_ru: Таблица курса валют

source: Currencies
ru_ru: Валюты

source: Rate
ru_ru: Ставка

source: Change %
ru_ru: Изменение %

source: Currency widgets for any needs.
ru_ru: Валютные виджеты на все случаи жизни.

source: LB company
ru_ru: Компания LB

source: http://exchangerate.guru
ru_ru: http://pokur.su
